import type {
  PalaceName,
  Division,
  MajorStarName,
  Star,
  MinorStarName,
  Luminosity,
  LuminosityIndex,
  StemIndex,
  BranchIndex,
  School
} from 'types';

/**
 * 宮名称
 *
 * @type {PalaceName[]}
 */
export const PALACE_NAMES: PalaceName[] = [
  '命宮',
  '父母宮',
  '福徳宮',
  '田宅宮',
  '官禄宮',
  '奴僕宮',
  '遷移宮',
  '疾厄宮',
  '財帛宮',
  '子女宮',
  '夫妻宮',
  '兄弟宮'
];

/**
 * 五号局
 *
 * @type {Division[]}
 */
export const DIVISIONS: Division[] = [
  { index: 0, value: '水二局' },
  { index: 1, value: '木三局' },
  { index: 2, value: '金四局' },
  { index: 3, value: '土五局' },
  { index: 4, value: '火六局' }
];

/**
 * 五号局対応表
 *
 * @type {number[][]}
 */
export const DIVISION_TABLE: number[][] = [
  [0, 4, 1, 3, 2, 4], // 甲己 => 水二・火六・木三・土五・金四・火六
  [4, 3, 2, 1, 0, 3], // 乙庚 => 火六・土五・金四・木三・水二・土五
  [3, 1, 0, 2, 4, 1], // 丙辛 => 土五・木三・水二・金四・火六・木三
  [1, 2, 4, 0, 3, 2], // 丁壬 => 木三・金四・火六・水二・土五・金四
  [2, 0, 3, 4, 1, 0] //  戊癸 => 金四・水二・土五・火六・木三・水二
];

/**
 * 主星
 *
 * @type {Star[]}
 */
export const MAJOR_STARS: Star[] = [
  { name: '紫微星', shortName: '紫微' },
  { name: '天機星', shortName: '天機' },
  { name: '太陽星', shortName: '太陽' },
  { name: '武曲星', shortName: '武曲' },
  { name: '天同星', shortName: '天同' },
  { name: '廉貞星', shortName: '廉貞' },
  { name: '天府星', shortName: '天府' },
  { name: '太陰星', shortName: '太陰' },
  { name: '貪狼星', shortName: '貪狼' },
  { name: '巨門星', shortName: '巨門' },
  { name: '天相星', shortName: '天相' },
  { name: '天梁星', shortName: '天梁' },
  { name: '七殺星', shortName: '七殺' },
  { name: '破軍星', shortName: '破軍' }
];

/**
 * 時系諸星
 *
 * @type {Star[]}
 */
export const HOURLY_STARS: Star[] = [
  { name: '文昌星', shortName: '文昌' },
  { name: '文曲星', shortName: '文曲' },
  { name: '天空星', shortName: '天空' },
  { name: '地劫星', shortName: '地劫' }
];

/**
 * 時系諸星（火星・鈴星）
 *
 * @type {Star[]}
 */
export const HOURLY_YEARLY_STARS: Star[] = [
  { name: '火星', shortName: '火星' },
  { name: '鈴星', shortName: '鈴星' }
];

/**
 * 月系諸星
 *
 * @type {Star[]}
 */
export const MONTHLY_STARS: Star[] = [
  { name: '左輔星', shortName: '左輔' },
  { name: '右弼星', shortName: '右弼' },
  { name: '天姚星', shortName: '天姚' },
  { name: '天刑星', shortName: '天刑' },
  { name: '陰煞星', shortName: '陰煞' }
];

/**
 * 年干系諸星
 *
 * @type {Star[]}
 */
export const YEARLY_STEM_STARS: Star[] = [
  { name: '禄存星', shortName: '禄存' },
  { name: '擎羊星', shortName: '擎羊' },
  { name: '陀羅星', shortName: '陀羅' },
  { name: '天魁星', shortName: '天魁' },
  { name: '天鉞星', shortName: '天鉞' },
];

/**
 * 四化星
 *
 * @type {Star[]}
 */
export const YEARLY_STEM_FOUR_STARS: Star[] = [
  { name: '化禄星', shortName: '化禄' },
  { name: '化権星', shortName: '化権' },
  { name: '化科星', shortName: '化科' },
  { name: '化忌星', shortName: '化忌' }
];

/**
 * 年支系諸星
 *
 * @type {Star[]}
 */
export const YEARLY_BRANCH_STARS: Star[] = [
  { name: '天喜星', shortName: '天喜' },
  { name: '紅鸞星', shortName: '紅鸞' },
  { name: '天馬星', shortName: '天馬' },
  { name: '龍池星', shortName: '龍池' },
  { name: '鳳閣星', shortName: '鳳閣' }
];

/**
 * 星の輝度
 *
 * @type {Luminosity[]}
 */
export const LUMINOSITY: Luminosity[] = [
  {
    name: '廟',
    intensity: 6
  },
  {
    name: '旺',
    intensity: 4
  },
  {
    name: '得地',
    intensity: 2
  },
  {
    name: '利益',
    intensity: 0
  },
  {
    name: '平和',
    intensity: 0
  },
  {
    name: '不得地',
    intensity: 0
  },
  {
    name: '陥',
    intensity: -2
  },
  {
    name: '',
    intensity: 0
  }
];

/**
 * 十干対応表
 * 甲0・乙1・丙2・丁3・戊4・己5・庚6・辛7・壬8・癸9
 *
 * @type {StemIndex[][]}
 */
export const STEM_TABLE: StemIndex[][] = [
  [2, 3, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1], // 甲己 | 丙丁丙丁戊己庚辛壬癸甲乙
  [4, 5, 4, 5, 6, 7, 8, 9, 0, 1, 2, 3], // 乙庚 | 戊己戊己庚辛壬癸甲乙丙丁
  [6, 7, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5], // 丙辛 | 庚辛庚辛壬癸甲乙丙丁戊己
  [8, 9, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7], // 丁壬 | 壬癸壬癸甲乙丙丁戊己庚辛
  [0, 1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9] //  戊癸 | 甲乙甲乙丙丁戊己庚辛壬癸
];

/**
 * 紫微星対応表
 * 子0・丑1・寅2・卯3・辰4・巳5・午6・未7・申8・酉9・戌10・亥11
 *
 * @type {BranchIndex[][]}
 */
export const PURPLE_STAR_POSITIONS: BranchIndex[][] = [
  [1, 4, 11, 6, 9], //    1 | 丑辰亥午酉
  [2, 1, 4, 11, 6], //    2 | 寅丑辰亥午
  [2, 2, 1, 4, 11], //    3 | 寅寅丑辰亥
  [3, 5, 2, 1, 4], //     4 | 卯巳寅丑辰
  [3, 2, 0, 2, 1], //     5 | 卯寅子寅丑
  [4, 3, 5, 7, 2], //     6 | 辰卯巳未寅
  [4, 6, 2, 0, 10], //    7 | 辰午寅子戌
  [5, 3, 3, 5, 7], //     8 | 巳卯卯巳未
  [5, 4, 1, 2, 0], //     9 | 巳辰丑寅子
  [6, 7, 6, 3, 5], //    10 | 午未午卯巳
  [6, 4, 3, 8, 2], //    11 | 午辰卯申寅
  [7, 5, 4, 1, 3], //    12 | 未巳辰丑卯
  [7, 8, 2, 6, 11], //   13 | 未申寅午亥
  [8, 5, 7, 3, 8], //    14 | 申巳未卯申
  [8, 6, 4, 4, 1], //    15 | 申午辰辰丑
  [9, 9, 5, 9, 6], //    16 | 酉酉巳酉午
  [9, 6, 3, 2, 3], //    17 | 酉午卯寅卯
  [10, 7, 8, 7, 4], //   18 | 戌未申未辰
  [10, 10, 5, 4, 0], //  19 | 戌戌巳辰子
  [11, 7, 6, 5, 9], //   20 | 亥未午巳酉
  [11, 8, 4, 10, 2], //  21 | 亥申辰戌寅
  [0, 11, 9, 3, 7], //   22 | 子亥酉卯未
  [0, 8, 6, 8, 4], //    23 | 子申午申辰
  [1, 9, 7, 5, 5], //    24 | 丑酉未巳巳
  [1, 0, 5, 6, 1], //    25 | 丑子巳午丑
  [2, 9, 10, 11, 10], // 26 | 寅酉戌亥戌
  [2, 10, 7, 4, 3], //   27 | 寅戌未辰卯
  [3, 1, 8, 9, 8], //    28 | 卯丑申酉申
  [3, 10, 6, 6, 5], //   29 | 卯戌午午巳
  [4, 11, 11, 7, 6] //   30 | 辰亥亥未午
];

/**
 * 主星対応表
 *
 * @type {BranchIndex[][]}
 */
export const MAJOR_STAR_POSITIONS: BranchIndex[][] = [
  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], // 紫微星 | 子丑寅卯辰巳午未申酉戌亥
  [11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10], // 天機星 | 亥子丑寅卯辰巳午未申酉戌
  [9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8], // 太陽星 | 酉戌亥子丑寅卯辰巳午未申
  [8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7], // 武曲星 | 申酉戌亥子丑寅卯辰巳午未
  [7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6], // 天同星 | 未申酉戌亥子丑寅卯辰巳午
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3], // 廉貞星 | 辰巳午未申酉戌亥子丑寅卯
  [4, 3, 2, 1, 0, 11, 10, 9, 8, 7, 6, 5], // 天府星 | 辰卯寅丑子亥戌酉申未午巳
  [5, 4, 3, 2, 1, 0, 11, 10, 9, 8, 7, 6], // 太陰星 | 巳辰卯寅丑子亥戌酉申未午
  [6, 5, 4, 3, 2, 1, 0, 11, 10, 9, 8, 7], // 貪狼星 | 午巳辰卯寅丑子亥戌酉申未
  [7, 6, 5, 4, 3, 2, 1, 0, 11, 10, 9, 8], // 巨門星 | 未午巳辰卯寅丑子亥戌酉申
  [8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10, 9], // 天相星 | 申未午巳辰卯寅丑子亥戌酉
  [9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10], // 天梁星 | 酉申未午巳辰卯寅丑子亥戌
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11], // 七殺星 | 戌酉申未午巳辰卯寅丑子亥
  [2, 1, 0, 11, 10, 9, 8, 7, 6, 5, 4, 3] //  破軍星 | 寅丑子亥戌酉申未午巳辰卯
];

/**
 * 主星力量表
 *
 * @type {number[][]}
 */
export const MAJOR_STAR_STRENGTHS: number[][] = [
  [0, 6, 4, 4, 2, 4, 6, 6, 4, 4, 2, 4], // 紫微星
  [6, 0, 2, 4, 0, 0, 6, 0, 2, 4, 0, 0], // 天機星
  [0, 0, 4, 6, 4, 4, 4, 2, 2, 0, 0, 0], // 太陽星
  [4, 6, 2, 0, 6, 0, 4, 6, 2, 0, 6, 0], // 武曲星
  [4, 0, 0, 0, 0, 6, 0, 0, 4, 0, 0, 6], // 天同星
  [-2, 0, 4, -2, 0, -6, -2, 0, 4, -2, 0, -6], // 廉貞星
  [6, 6, 6, 2, 6, 2, 4, 6, 2, 4, 6, 2], // 天府星
  [6, 6, 4, 0, 0, 0, 0, 0, 0, 4, 4, 6], // 太陰星
  [2, 4, -2, 0, 4, -6, 2, 4, -2, 0, 4, -6], // 貪狼星
  [2, -4, 4, 4, -6, 2, 2, -4, 4, 4, -6, 2], // 巨門星
  [6, 6, 6, 0, 2, 2, 6, 2, 6, 0, 2, 2], // 天相星
  [6, 4, 6, 6, 6, 0, 6, 4, 0, 2, 6, 0], // 天梁星
  [2, 4, 4, 2, 4, -2, 2, 4, 4, 2, 4, -2], // 七殺星
  [4, 2, 0, -6, 2, -2, 4, 2, 0, -6, 2, -2] //  破軍星
];

/**
 * 主星輝度表
 *
 * @type {number[][]}
 */
export const MAJOR_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [4, 0, 1, 1, 2, 1, 0, 0, 1, 1, 2, 1], // 紫微星 | 平廟旺旺地旺廟廟旺旺地旺
  [0, 6, 2, 1, 3, 4, 0, 6, 2, 1, 3, 4], // 天機星 | 廟陥地旺利平廟陥地旺利平
  [6, 5, 1, 0, 1, 1, 1, 2, 2, 4, 5, 6], // 太陽星 | 廟陥地旺利平廟陥地旺利平
  [1, 0, 2, 3, 0, 4, 1, 0, 2, 3, 0, 4], // 武曲星 | 旺廟地利廟平旺廟地利廟平
  [1, 5, 3, 4, 4, 0, 6, 5, 1, 4, 4, 0], // 天同星 | 旺不利平平廟陥不旺平平廟
  [4, 3, 6, 4, 3, 6, 4, 3, 0, 4, 3, 6], // 廉貞星 | 平利廟平利陥平利廟平利陥
  [0, 0, 0, 2, 0, 2, 1, 0, 2, 1, 0, 2], // 天府星 | 廟廟廟地廟地旺廟地旺廟地
  [0, 0, 1, 6, 6, 6, 5, 5, 3, 1, 1, 0], // 太陰星 | 廟廟旺陥陥陥不不利旺旺廟
  [1, 0, 4, 3, 0, 6, 1, 0, 4, 3, 0, 6], // 貪狼星 | 旺廟平利廟陥旺廟平利廟陥
  [1, 5, 0, 0, 6, 1, 1, 5, 0, 0, 6, 1], // 巨門星 | 旺不廟廟陥旺旺不廟廟陥旺
  [0, 0, 0, 6, 2, 2, 0, 2, 0, 6, 2, 2], // 天相星 | 廟廟廟陥地地廟地廟陥地地
  [0, 1, 0, 0, 0, 6, 0, 1, 6, 2, 0, 6], // 天梁星 | 廟旺廟廟廟陥廟旺陥地廟陥
  [1, 0, 0, 1, 0, 4, 1, 0, 0, 1, 0, 5], // 七殺星 | 旺廟廟旺廟平旺廟廟旺廟平
  [0, 1, 5, 6, 1, 4, 0, 1, 2, 6, 1, 4] //  破軍星 | 廟旺地陥旺平廟旺地陥旺平
];

/**
 * 時系諸星対応表
 * 文昌星・文曲星・天空星・地劫星
 *
 * @type {BranchIndex[][]}
 */
export const HOURLY_STAR_POSITIONS: BranchIndex[][] = [
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11], // 文昌星 | 戌酉申未午巳辰卯寅丑子亥
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3], // 文曲星 | 辰巳午未申酉戌亥子丑寅卯
  [11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0], // 天空星 | 亥戌酉申未午巳辰卯寅丑子
  [11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10] //  地劫星 | 亥子丑寅卯辰巳午未申酉戌
];

/**
 * 時系諸星力量表
 * 文昌星・文曲星・天空星・地劫星
 *
 * @type {number[][]}
 */
export const HOURLY_STAR_STRENGTHS: number[][] = [
  [1, 3, 0, 0, 1, 3, 0, 0, 1, 3, 0, 0], // 文昌星
  [1, 3, 0, 2, 1, 3, 0, 2, 1, 3, 0, 2], // 文曲星
  [-3, -3, -3, -3, -3, -3, -3, -3, -3, -3, -3, -3], // 天空星
  [-3, -3, -3, -3, -3, -3, -3, -3, -3, -3, -3, -3] //  地劫星
];

/**
 * 時系諸星輝度表
 * 文昌星・文曲星・天空星・地劫星
 *
 * @type {number[][]}
 */
export const HOURLY_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [2, 0, 6, 3, 2, 0, 6, 3, 2, 0, 6, 3], // 文昌星 | 地廟陥利地廟陥利地廟陥利
  [2, 0, 6, 3, 2, 0, 6, 3, 2, 0, 6, 3], // 文曲星 | 地廟平旺地廟陥旺地廟陥旺
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 天空星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7] //  地劫星 | 不明
];

/**
 * 火星・鈴星対応表
 *
 * @type {BranchIndex[][][]}
 */
export const HOURLY_YEARLY_STAR_POSITIONS: BranchIndex[][][] = [
  [
    // 寅午戌
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0], // 火星 | 丑寅卯辰巳午未申酉戌亥子
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2] //  鈴星 | 卯辰巳午未申酉戌亥子丑寅
  ],
  [
    // 申子辰
    [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1], // 火星 | 寅卯辰巳午未申酉戌亥子丑
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9] //  鈴星 | 戌亥子丑寅卯辰巳午未申酉
  ],
  [
    // 巳酉丑
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2], // 火星 | 卯辰巳午未申酉戌亥子丑寅
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9] //  鈴星 | 戌亥子丑寅卯辰巳午未申酉
  ],
  [
    // 亥卯未
    [9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8], // 火星 | 酉戌亥子丑寅卯辰巳午未申
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9] //  鈴星 | 戌亥子丑寅卯辰巳午未申酉
  ]
];

/**
 * 火星・鈴星力量表
 *
 * @type {number[][]}
 */
export const HOURLY_YEARLY_STAR_STRENGTHS: number[][] = [
  [-3, 0, 2, 0, -3, 0, 2, 0, -3, 0, 2, 0], // 火星
  [-3, 0, 2, 0, -3, 0, 2, 0, -3, 0, 2, 0] // 鈴星
];

/**
 * 火星・鈴星輝度表
 *
 * @type {number[][]}
 */
export const HOURLY_YEARLY_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [6, 2, 0, 3, 6, 2, 0, 3, 6, 2, 0, 3], // 火星
  [6, 2, 0, 3, 6, 2, 0, 3, 6, 2, 0, 3] // 鈴星
];

/**
 * 月系諸星対応表
 * 左輔星・右弼星・天姚星・天刑星・陰煞星
 *
 * @type {BranchIndex[][]}
 */
export const MONTHLY_STAR_POSITIONS: BranchIndex[][] = [
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3], // 左輔星 | 辰巳午未申酉戌亥子丑寅卯
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11], // 右弼星 | 戌酉申未午巳辰卯寅丑子亥
  [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0], // 天姚星 | 丑寅卯辰巳午未申酉戌亥子
  [9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8], // 天刑星 | 酉戌亥子丑寅卯辰巳午未申
  [2, 0, 10, 8, 6, 4, 2, 0, 10, 8, 6, 4] // 陰煞星 | 寅子戌申午辰寅子戌申午辰
];

/**
 * 月系諸星力量表
 * 左輔星・右弼星・天姚星・天刑星・陰煞星
 *
 * @type {number[][]}
 */
export const MONTHLY_STAR_STRENGTHS: number[][] = [
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], // 左輔星
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], // 右弼星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], // 天姚星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], // 天刑星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] // 陰煞星
];

/**
 * 月系諸星輝度表
 * 左輔星・右弼星・天姚星・天刑星・陰煞星
 *
 * @type {number[][]}
 */
export const MONTHLY_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 左輔星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 右弼星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 天姚星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 天刑星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7] // 陰煞星 | 不明
];

/**
 * 年干系諸星対応表
 * 禄存星・擎羊星・陀羅星・天魁星・天鉞星
 *
 * @type {BranchIndex[][]}
 */
export const YEARLY_STEM_STAR_POSITIONS: BranchIndex[][] = [
  [2, 3, 5, 6, 5, 6, 8, 9, 11, 0], //  禄存星 | 寅卯巳午巳午申酉亥子
  [3, 4, 6, 7, 6, 7, 9, 10, 0, 1], //  擎羊星 | 卯辰午未午未酉戌子丑
  [1, 2, 4, 5, 4, 5, 7, 8, 10, 11], // 陀羅星 | 丑寅辰巳辰巳未申戌亥
  [1, 0, 11, 11, 1, 0, 1, 6, 3, 3], // 天魁星 | 丑子亥亥丑子丑午卯卯
  [7, 8, 9, 9, 7, 8, 7, 2, 5, 5] //    天鉞星 | 未申酉酉未申未寅巳巳
];

/**
 * 年干系諸星力量表
 * 禄存星・擎羊星・陀羅星・天魁星・天鉞星
 *
 * @type {number[][]}
 */
export const YEARLY_STEM_STAR_STRENGTHS: number[][] = [
  [3, 0, 3, 3, 0, 3, 3, 0, 3, 3, 0, 3], // 禄存星
  [-3, 2, 0, -3, 2, 0, -3, 2, 0, -3, 2, 0], // 擎羊星
  [0, 2, -3, 0, 2, -3, 0, 2, -3, 0, 2, -3], // 陀羅星
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], // 天魁星
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3] // 天鉞星
];

/**
 * 年干系諸星輝度表
 * 禄存星・擎羊星・陀羅星・天魁星・天鉞星
 *
 * @type {number[][]}
 */
export const YEARLY_STEM_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [0, 7, 0, 0, 7, 0, 0, 7, 0, 0, 7, 0], // 禄存星 | 廟＿廟廟＿廟廟＿廟廟＿廟
  [6, 0, 7, 6, 0, 7, 6, 0, 7, 6, 0, 7], // 擎羊星 | 陥廟＿陥廟＿陥廟＿陥廟＿
  [7, 0, 6, 7, 0, 6, 7, 0, 6, 7, 0, 6], // 陀羅星 | ＿陥廟＿陥廟＿陥廟＿陥廟
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 天魁星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7] // 天鉞星 | 不明
];

/**
 * 年支系諸星対応表
 * 天喜星・紅鸞星・天馬星・龍池星・鳳閣星
 *
 * @type {number[][]}
 */
export const YEARLY_BRANCH_STAR_POSITIONS: BranchIndex[][] = [
  [9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10], // 天喜星 | 酉申未午巳辰卯寅丑子亥戌
  [3, 2, 1, 0, 11, 10, 9, 8, 7, 6, 5, 4], // 紅鸞星 | 卯寅丑子亥戌酉申未午巳辰
  [2, 11, 8, 5, 2, 11, 8, 5, 2, 11, 8, 5], // 天馬星 | 寅亥申巳寅亥申巳寅亥申巳
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3], // 龍池星 | 辰巳午未申酉戌亥子丑寅卯
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11], // 鳳閣星 | 戌酉申未午巳辰卯寅丑子亥
];

/**
 * 年支系諸星力量表
 * 天喜星・紅鸞星・天馬星・龍池星・鳳閣星
 *
 * @type {number[][]}
 */
export const YEARLY_BRANCH_STAR_STRENGTHS: number[][] = [
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], // 天喜星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], // 紅鸞星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], // 天馬星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], // 龍池星
  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] // 鳳閣星
];

/**
 * 年支系諸星輝度表
 * 天喜星・紅鸞星・天馬星・龍池星・鳳閣星
 *
 * @type {number[][]}
 */
export const YEARLY_BRANCH_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 天喜星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 紅鸞星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 天馬星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 龍池星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7] // 鳳閣星 | 不明
];

/**
 * 四化星対応表
 * 化禄星・化権星・化科星・化忌星
 *
 * @type {((MajorStarName | MinorStarName)[][])}
 */
export const FOUR_STAR_POSITIONS: (MajorStarName | MinorStarName)[][] = [
  [ // 化禄星
    '廉貞星', // 甲
    '天機星', // 乙
    '天同星', // 丙
    '太陰星', // 丁
    '貪狼星', // 戊
    '武曲星', // 己
    '太陽星', // 庚
    '巨門星', // 辛
    '天梁星', // 壬
    '破軍星'  // 癸
  ],
  [ // 化権星
    '破軍星', // 甲
    '天梁星', // 乙
    '天機星', // 丙
    '天同星', // 丁
    '太陰星', // 戊
    '貪狼星', // 己
    '武曲星', // 庚
    '太陽星', // 辛
    '紫微星', // 壬
    '巨門星'  // 癸
  ],
  [ // 化科星
    '武曲星', // 甲
    '紫微星', // 乙
    '文昌星', // 丙
    '天機星', // 丁
    '右弼星', // 戊
    '天梁星', // 己
    '太陰星', // 庚
    '文曲星', // 辛
    '左輔星', // 壬
    '太陰星'  // 癸
  ],
  [ // 化忌星
    '太陽星', // 甲
    '太陰星', // 乙
    '廉貞星', // 丙
    '巨門星', // 丁
    '天機星', // 戊
    '文曲星', // 己
    '天同星', // 庚
    '文昌星', // 辛
    '武曲星', // 壬
    '貪狼星'  // 癸
  ]
];

/**
 * 四化星力量表
 * 化禄星・化権星・化科星・化忌星
 *
 * @type {number[][]}
 */
export const FOUR_STAR_STRENGTHS: number[][] = [
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], // 化禄星
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], // 化権星
  [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], // 化科星
  [-3, -3, -3, -3, -3, -3, -3, -3, -3, -3, -3, -3] // 化忌星
];

/**
 * 四化星輝度表
 * 化禄星・化権星・化科星・化忌星
 *
 * @type {number[][]}
 */
export const FOUR_STAR_LUMINOSITY: LuminosityIndex[][] = [
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 化禄星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 化権星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7], // 化科星 | 不明
  [7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7] // 化忌星 | 不明
];

/**
 * 流派
 *
 * @type {Star[]}
 */
export const SCHOOLS: School[] = [
  { name: '星曜派', value: 's' },
  { name: '飛星派', value: 'h' }
];